{"":{"172;9;Spiky-eared Pichu can only be received by taking the shiny Pichu from an official promotion to []{pokemon:celebi}'s shrine in []{location:ilex-forest}.  Spiky-eared Pichu is always female":"","201;9;Forms only affect appearance.  A form is determined at random before a wild encounter and cannot be changed.":"","351;9;Form changes along with type to match the [weather]{mechanic:weather} in battle":"","386;9;\"Forms have different stats and can learn different moves.  Moves are retained through form changes.":"","In Generation III":"depending on the game:","* Diamond":"","* HeartGold and SoulSilver: At the west end of []{location:kanto-route-3}":"","* Black and White 1 & 2: In the museum in []{location:nacrene-city}":"","412;9;\"Forms only affect appearance":"","413;9;Forms have different stats and movepools.  During evolution":"","421;9;Sunshine form is active during [strong sunlight]{mechanic:strong-sunlight}.  Otherwise":"","422;9;Forms only affect appearance.  A form is determined before a wild encounter based on whether the battle is in western or eastern Sinnoh":"","423;9;Forms only affect appearance.  A form is determined before a wild encounter based on whether the battle is in western or eastern Sinnoh and cannot be changed.":"","479;9;\"Forms have different signature moves and types":"","When switching forms":"","Appliances for switching Rotom's form can be found in the following locations":"","* Platinum: In the Team Galactic Eterna Building.  Requires a []{item:secret-key}.":"","* HeartGold and SoulSilver: In the Silph Co. Office Building.  Enter the building when walking with Rotom and enter the broken elevator.":"","* Black and White 1 & 2: In Shopping Mall Nine.  Found in boxes in a storage room on the first floor on the far right.":"","487;9;\"Forms have different stats and can learn different moves from tutors.  Moves are retained through form changes.  Giratina transforms into Origin Forme in the []{location:distortion-world} or while holding a []{item:griseous-orb}.  Otherwise":"","In Generation IV":"","492;9;\"Forms have different stats and can learn different moves.  Moves are retained through form changes.  Shaymin transforms into Sky Forme with the use of a []{item:gracidea}.  It is limited to Land Forme at night":"","In Generation IV__1":"","A Gracidea may be received by showing a Shaymin met in a fateful encounter to a certain NPC":"","* Platinum: A woman in southwest []{location:floaroma-town}.":"","* HeartGold and SoulSilver: The owner of the []{location:goldenrod-city} flower shop.":"","* Black and White: A woman in the []{location:lacunosa-town} Pokémon Center.":"","* Black 2 and White 2: A woman in the []{location:striaton-city} Pokémon Center.":"","493;9;Form changes along with type to match a held Plate":"","550;9;Forms have one different ability and different wild held items.  Blue-Striped Basculin are rarer in Black Version and Black Version 2":"","555;9;Forms have different stats and types.  If Darmanitan's ability is []{ability:zen-mode}":"","585;9;\"Forms only affect appearance.  Deerling switches forms to match the season if it is in the party upon loading the game.":"","If the season has changed since the game was saved":"","586;9;\"Forms only affect appearance.  Sawsbuck switches forms to match the season if it is in the party upon loading the game.":"","If the season has changed since the game was saved__1":"","641;9;\"Forms have different stats and abilities.  Tornadus switches forms when the []{item:reveal-glass} is used on it.":"","The Reveal Glass may be obtained by taking a Therian []{pokemon:landorus} to []{location:abundant-shrine}.  (Landorus can be obtained in Therian Forme from the Dream Radar.)":"","642;9;\"Forms have different stats and abilities.  Thundurus switches forms when the []{item:reveal-glass} is used on it.":"","The Reveal Glass may be obtained by taking a Therian []{pokemon:landorus} to []{location:abundant-shrine}.  (Landorus can be obtained in Therian Forme from the Dream Radar.)__1":"","645;9;\"Forms have different stats and abilities.  Landorus switches forms when the []{item:reveal-glass} is used on it.":"","The Reveal Glass may be obtained by taking a Therian Landorus to []{location:abundant-shrine}.  (Landorus can be obtained in Therian Forme from the Dream Radar.)":"","646;9;Forms have different stats":"","647;9;Forms only affect appearance.  In Black and White Versions 2":"","648;9;Forms have different stats and types.  Meloetta changes form upon using []{move:relic-song} in battle":"","649;9;Form changes to match Genesect's held Drive.  The only differences are the color of its weapon and []{move:techno-blast}'s type.":"","666;9;\"Forms only differ in appearance.  Vivillon's pattern depends on the real-world geographical region set in its original trainer's 3DS":"","Trading a Scatterbug":"","The Fancy and Poké Ball Patterns do not correspond to any region and are only available through distributions.":"","669;9;Forms only differ in appearance.  Flabébé's flower is set when it is encountered":"","670;9;\"Floette's five regular forms only differ in appearance.  Floette's flower is set when it is encountered":"","Eternal Floette has higher stats":"","671;9;Forms only differ in appearance.  Florges's flower is set as a Flabébé or Floette":"","676;9;Forms only differ in appearance.  Furfrou's trim can be changed at any time in Friseur Furfrou in Lumiose City.  It reverts to its Natural Form after five days unless trimmed again":"","678;9;Male and female Meowstic have different level-up moves and hidden abilities.  While gender differences are not usually considered to be separate forms":"","681;9;Forms have different stats.  If Aegislash's ability is []{ability:stance-change}":"","710;9;Forms have different stats.  Pumpkaboo's size is set when it is encountered":"","711;9;Forms have different stats.  Gourgeist's size is set as a Pumpkaboo":"","716;9;Forms only differ in appearance.  Xerneas is always in Neutral Mode outside of battle":""}}