{"local_language_id":{"1":6,"2":6,"3":6,"4":6,"5":6,"6":6,"7":9,"8":9,"9":9,"10":6,"1__1":9,"2__1":9,"3__1":9,"4__1":9,"5__1":9,"6__1":9,"10__1":9,"4__2":10,"5__2":10,"10__2":10,"3__2":10,"6__2":10,"8__1":10,"2__2":10,"9__1":10,"7__1":10,"1__2":10},"name":{"1":"Level up","2":"Ei","3":"Tutor","4":"Maschine","5":"Stadium: Surfendes Pikachu","6":"Volttackle Pichu","7":"Colosseum: Purification","8":"XD: Shadow","9":"XD: Purification","10":"Rotom Formen","1__1":"Level up","2__1":"Egg","3__1":"Tutor","4__1":"Machine","5__1":"Stadium: Surfing Pikachu","6__1":"Volt Tackle Pichu","10__1":"Form Change","4__2":"Přístrojem","5__2":"Stadium: Surfující Pikachu","10__2":"Forma Rotoma","3__2":"Od učitele","6__2":"Light Ball","8__1":"XD: Stínový útok","2__2":"Vajíčkový","9__1":"XD: Purifikace","7__1":"Colosseum: Purifikace","1__2":"Úrovní"},"description":{"1":"Wird gelernt, wenn ein Pokémon ein bestimmtes Level erreicht.","2":"Erscheint bei einem frisch geschlüpften Pokémon, wenn der Vater die selbe Fähigkeit hatte.","3":"Kann jederzeit von einem NPC erlernt werden.","4":"Kann jederzeit durch das benutzen eines TM oder VM erlernt werden.","5":"Wird gelernt, wenn ein Pikachu dabei hilft den Premium-Cup in der Kategorie Meisterball ohne unterbrechung zu besiegen.  Es muss in jedem Kampf teilnehmen.","6":"Erscheint bei einem Pichu dessen Mutter einen Kugelblitz trug.  Der Vater darf nicht Ditto sein.","7":"Appears on a Shadow Pokémon as it becomes increasingly purified.","8":"Appears on a Snatched Shadow Pokémon.","9":"Appears on a Shadow Pokémon as it becomes increasingly purified.","10":"Erscheint, wenn Rotom seine Form wechselt.  Verschwindet wenn Rotom eine andere Form an nimmt. Diese Fähigkeit kann nur durch wechseln der Form erlernt werden.","1__1":"Learned when a Pokémon reaches a certain level.","2__1":"Appears on a newly-hatched Pokémon, if the father had the same move.","3__1":"Can be taught at any time by an NPC.","4__1":"Can be taught at any time by using a TM or HM.","5__1":"Learned when a non-rental Pikachu helps beat Prime Cup Master Ball R-2.  It must participate in every battle, and you must win with no continues.","6__1":"Appears on a Pichu whose mother was holding a Light Ball.  The father cannot be Ditto.","10__1":"Appears when Rotom or Cosplay Pikachu changes form.  Disappears if the Pokémon becomes another form and this move can only be learned by form change.","4__2":"Učené použitím TM nebo HM","5__2":"","10__2":"Objeví se u Rotoma, když se změní do určité formy.  Zmizí, když se Rotom změní do jiné formy, pokud se tento útok dá naučit jen změnou formy.","3__2":"Učené nějakou postavou ve hře.","6__2":"Objeví se u Pichu, jehož matka držela Light Ball. Otec nesmí být Ditto.","8__1":"U ukradených „Shadow“ pokémonů","2__2":"Dědí se od otce.","9__1":"Objeví se u „Shadow“ pokémona, jak se mu otevírá srdce.","7__1":"Objeví se u „Shadow“ pokémona, jak se mu otevírá srdce.","1__2":"Učení dosažením určité úrovně."}}