{"local_language_id":{"1":9,"2":9,"3":9,"4":9,"5":9,"6":9,"7":9,"8":9,"9":9,"10":9,"11":9,"12":9,"13":9,"14":9,"15":9,"16":9,"17":9,"18":9,"19":9,"20":9,"21":9},"name":{"1":"User","2":"Single tile","3":"Two-tile column","4":"Three-tile column","5":"Adjacent diamond","6":"Adjacent ring","7":"Row","8":"Chevron","9":"Plus","10":"X-shape","11":"Two ahead","12":"Three ahead","13":"Diamond two ahead","14":"Ring in front","15":"Row two ahead","16":"Two rows two ahead","17":"Column two ahead","18":"X-shape two ahead","19":"Dai","20":"T-shape","21":"Two rows"},"description":{"1":"The user.","2":"A single tile directly in front of the user.","3":"Two tiles in a column in front of the user.","4":"Three tiles in a column in front of the user.","5":"The four tiles adjacent to the user.","6":"Eight tiles in a ring around the user.","7":"Three tiles in a line centered directly in front of the user.","8":"Three tiles in the shape of a chevron (^), with the apex two tiles in front of the user.","9":"Five tiles in a plus shape centered two tiles in front of the user.","10":"Five tiles in an X shape centered directly in front of the user.","11":"A single tile two tiles in front of the user.","12":"A single tile three tiles in front of the user.","13":"Four tiles in a diamond centered two tiles in front of the user.","14":"Eight tiles in a ring centered two tiles in front of the user.","15":"Three tiles in a line centered two tiles in front of the user.","16":"Six tiles in two rows of three, one centered two tiles in front of the user and the other three tiles.","17":"A column of two tiles starting two tiles in front of the user.","18":"Five tiles in an X shape centered two tiles in front of the user.","19":"Seven tiles in the shape of the kanji 大 (dai), consisting of five squares in a plus shape in front of the user and one square on either side of the user.","20":"Four tiles in the shape of a T, consisting of the tile directly in front of the user and a row of three tiles centered two tiles in front of the user.","21":"Six tiles in two rows of three, one centered directly in front of the user and the other two tiles in front of the user."}}